{"modelTopology": {"training_config": {"metrics": ["dice_whole_metric", "dice_core_metric", "dice_en_metric"], "loss": "gen_dice_loss", "optimizer_config": {"class_name": "SGD", "config": {"nesterov": false, "lr": 7.99999907030724e-05, "momentum": 0.8999999761581421, "decay": 0.004999999888241291}}, "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.2.0", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 4], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "GaussianNoise", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "name": "gaussian_noise_1", "stddev": 0.01}, "name": "gaussian_noise_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["gaussian_noise_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2]}, "name": "conv2d_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_1"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "p_re_lu_1", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_2"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "p_re_lu_2", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_3"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_1", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1"}, "name": "add_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2]}, "name": "conv2d_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_3"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "p_re_lu_3", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_4"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "p_re_lu_4", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_6"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "config": {"trainable": true, "name": "add_2"}, "name": "add_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2]}, "name": "conv2d_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_5"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "p_re_lu_5", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_6"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "p_re_lu_6", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_9", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_9"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_7", 0, 0, {}], ["conv2d_9", 0, 0, {}]]], "config": {"trainable": true, "name": "add_3"}, "name": "add_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_10", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2]}, "name": "conv2d_10"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_7"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"name": "p_re_lu_7", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_7", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_11", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_11"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_8"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "p_re_lu_8", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_8", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_12", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_12"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["conv2d_12", 0, 0, {}]]], "config": {"trainable": true, "name": "add_4"}, "name": "add_4"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1"}, "name": "up_sampling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_13", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2]}, "name": "conv2d_13"}, {"class_name": "Concatenate", "inbound_nodes": [[["add_3", 0, 0, {}], ["conv2d_13", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "name": "concatenate_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_9"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"name": "p_re_lu_9", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_14", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_14"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_10"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "p_re_lu_10", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_10"}, {"class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_16", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_16"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_10", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_15", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_15"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["conv2d_15", 0, 0, {}]]], "config": {"trainable": true, "name": "add_5"}, "name": "add_5"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling2d_2"}, "name": "up_sampling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_17", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2]}, "name": "conv2d_17"}, {"class_name": "Concatenate", "inbound_nodes": [[["add_2", 0, 0, {}], ["conv2d_17", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_2", "axis": -1}, "name": "concatenate_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_11"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"name": "p_re_lu_11", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_11"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_11", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_18", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_18"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_12"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"name": "p_re_lu_12", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_12"}, {"class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_20", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_20"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_12", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_19", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_19"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["conv2d_19", 0, 0, {}]]], "config": {"trainable": true, "name": "add_6"}, "name": "add_6"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling2d_3"}, "name": "up_sampling2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_21", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2]}, "name": "conv2d_21"}, {"class_name": "Concatenate", "inbound_nodes": [[["add_1", 0, 0, {}], ["conv2d_21", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_3", "axis": -1}, "name": "concatenate_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_13"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"name": "p_re_lu_13", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_13"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_13", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_22", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_22"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_14"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"name": "p_re_lu_14", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_14"}, {"class_name": "Conv2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_24", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_24"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_14", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_23", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_23"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_24", 0, 0, {}], ["conv2d_23", 0, 0, {}]]], "config": {"trainable": true, "name": "add_7"}, "name": "add_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_15"}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"name": "p_re_lu_15", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2]}, "name": "p_re_lu_15"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_15", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_25", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_25"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "name": "activation_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["activation_1", 0, 0]]}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of10", "group1-shard2of10", "group1-shard3of10", "group1-shard4of10", "group1-shard5of10", "group1-shard6of10", "group1-shard7of10", "group1-shard8of10", "group1-shard9of10", "group1-shard10of10"], "weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_1/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_10/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_10/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_10/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_10/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_11/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_11/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_11/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_11/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_12/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_12/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_12/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_12/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_14/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_14/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_14/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_14/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_15/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_15/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_15/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_15/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_5/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_5/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_5/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_5/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_7/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_7/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_7/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_7/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_8/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_8/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_8/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_8/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/moving_variance"}, {"dtype": "float32", "shape": [2, 2, 4, 64], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_1/bias"}, {"dtype": "float32", "shape": [2, 2, 256, 512], "name": "conv2d_10/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv2d_10/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv2d_11/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv2d_11/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv2d_12/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv2d_12/bias"}, {"dtype": "float32", "shape": [2, 2, 512, 256], "name": "conv2d_13/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_13/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 256], "name": "conv2d_14/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_14/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "conv2d_15/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_15/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 256], "name": "conv2d_16/kernel"}, {"dtype": "float32", "shape": [2, 2, 256, 128], "name": "conv2d_17/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_17/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 128], "name": "conv2d_18/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_18/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "conv2d_19/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_19/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_2/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_20/kernel"}, {"dtype": "float32", "shape": [2, 2, 128, 64], "name": "conv2d_21/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_21/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 64], "name": "conv2d_22/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_22/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_23/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_23/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 64], "name": "conv2d_24/kernel"}, {"dtype": "float32", "shape": [1, 1, 64, 4], "name": "conv2d_25/kernel"}, {"dtype": "float32", "shape": [4], "name": "conv2d_25/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_3/bias"}, {"dtype": "float32", "shape": [2, 2, 64, 128], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_4/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "conv2d_5/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_5/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "conv2d_6/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_6/bias"}, {"dtype": "float32", "shape": [2, 2, 128, 256], "name": "conv2d_7/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_7/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "conv2d_8/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_8/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "conv2d_9/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_9/bias"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_1/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_10/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_11/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_12/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_13/alpha"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_14/alpha"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_15/alpha"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_2/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_3/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_4/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_5/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_6/alpha"}, {"dtype": "float32", "shape": [1, 1, 512], "name": "p_re_lu_7/alpha"}, {"dtype": "float32", "shape": [1, 1, 512], "name": "p_re_lu_8/alpha"}, {"dtype": "float32", "shape": [1, 1, 512], "name": "p_re_lu_9/alpha"}]}]}