{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of10", "group1-shard2of10", "group1-shard3of10", "group1-shard4of10", "group1-shard5of10", "group1-shard6of10", "group1-shard7of10", "group1-shard8of10", "group1-shard9of10", "group1-shard10of10"], "weights": [{"dtype": "float32", "shape": [2, 2, 4, 64], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_1/bias"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_1/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_1/alpha"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_2/bias"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_2/alpha"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_3/bias"}, {"dtype": "float32", "shape": [2, 2, 64, 128], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_4/bias"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_3/alpha"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "conv2d_5/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_5/bias"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_4/alpha"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "conv2d_6/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_6/bias"}, {"dtype": "float32", "shape": [2, 2, 128, 256], "name": "conv2d_7/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_7/bias"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_5/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_5/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_5/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_5/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_5/alpha"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "conv2d_8/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_8/bias"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_6/alpha"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "conv2d_9/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_9/bias"}, {"dtype": "float32", "shape": [2, 2, 256, 512], "name": "conv2d_10/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv2d_10/bias"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_7/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_7/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_7/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_7/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512], "name": "p_re_lu_7/alpha"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv2d_11/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv2d_11/bias"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_8/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_8/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_8/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_8/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512], "name": "p_re_lu_8/alpha"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv2d_12/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv2d_12/bias"}, {"dtype": "float32", "shape": [2, 2, 512, 256], "name": "conv2d_13/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_13/bias"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512], "name": "p_re_lu_9/alpha"}, {"dtype": "float32", "shape": [3, 3, 512, 256], "name": "conv2d_14/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_14/bias"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_10/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_10/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_10/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_10/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_10/alpha"}, {"dtype": "float32", "shape": [1, 1, 512, 256], "name": "conv2d_16/kernel"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "conv2d_15/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_15/bias"}, {"dtype": "float32", "shape": [2, 2, 256, 128], "name": "conv2d_17/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_17/bias"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_11/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_11/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_11/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_11/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_11/alpha"}, {"dtype": "float32", "shape": [3, 3, 256, 128], "name": "conv2d_18/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_18/bias"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_12/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_12/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_12/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_12/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_12/alpha"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_20/kernel"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "conv2d_19/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_19/bias"}, {"dtype": "float32", "shape": [2, 2, 128, 64], "name": "conv2d_21/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_21/bias"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_13/alpha"}, {"dtype": "float32", "shape": [3, 3, 128, 64], "name": "conv2d_22/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_22/bias"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_14/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_14/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_14/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_14/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_14/alpha"}, {"dtype": "float32", "shape": [1, 1, 128, 64], "name": "conv2d_24/kernel"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_23/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_23/bias"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_15/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_15/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_15/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_15/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_15/alpha"}, {"dtype": "float32", "shape": [1, 1, 64, 4], "name": "conv2d_25/kernel"}, {"dtype": "float32", "shape": [4], "name": "conv2d_25/bias"}]}]}